<template>
  <div class="min-h-dvh w-full flex items-center justify-center">
    <div class="flex flex-col gap-4">
      <div class="text-2xl font-bold text-center">
        {{ questions[currentQuestion] }}
      </div>
      
      <div class="w-full flex gap-4">
        <button
          class="bg-green-700 hover:bg-green-800 transition uppercase font-bold text-xs w-full rounded p-2 cursor-pointer"
          type="button"
          @click="onClickPrev"
        >
          Назад
        </button>
        <button
          class="bg-green-700 hover:bg-green-800 transition uppercase font-bold text-xs w-full rounded p-2 cursor-pointer"
          type="button"
          @click="onClickNext"
        >
          Вперёд
        </button>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
import { ref } from 'vue'


const currentQuestion = ref(0)
const onClickPrev = () => {
  if (currentQuestion.value > 0) {
    currentQuestion.value -= 1
  }
}
const onClickNext = () => {
  if (currentQuestion.value < questions.length - 1) {
    currentQuestion.value += 1
  }
}

const questions = [
  'Почему рекомендуется выполнять проверку модели на валидационных данных (в качестве альтернативы простому использованию всех тренировочных данных)?',
  'Проверка модели на каких данных дает представление о недообучении, а какие для оценки переобучения?',
  'Почему при предварительной обработке числовых и категориальных признаков необходимо сохранять параметры преобразования, а не преобразовывать тестовые (новые) данные отдельно?',
  'Как можно использовать категориальные данные в моделях машинного обучения? В каких случаях какой подход будет предпочтительней?',
  'Ключевые шаги модели линейной регрессии. Обоснование функции потерь',
  'Ключевые шаги модели логистической регрессии. Обоснование функции потерь',
  'Почему использование L1 регуляризации для линейных моделей может привести к отбору признаков (в отличие от L2 регуляризации)?',
  'Что является степенью значимости признаков при использовании метода главных компонент?',
  'Перечислите хотя бы 5 функций, которые можно использовать для оценки близости векторов (https://arxiv.org/pdf/1708.04321.pdf - ребята тут чуть ли не 100 метрик сравнивают)',
  'В чем основное отличие использования метода k-ближайших соседей в качестве классификатора и регрессии?',
  'Как можно ускорить применение методов ближайших соседей?',
  'Какие особенности применение градиентного спуска в методе визуализации t-SNE?',
  'Что означает буква t в методе визуализации t-SNE?',
  'В чем ключевая идея метода визуализации t-SNE?',
  'В чем отличие построение линий в линейной / логистической регрессии и в методе опорных векторов?',
  'Почему Kernel trick помогает улучшить результаты метода опорных векторов?',
  'В чем отличие радиальной базисной функции от меры подобия, используемой в t-SNE для оценки близости в исходном пространстве признаков?',
  'В чем разница между использованием деревьев решений в задачах классификации и регрессии?',
  'Представьте, что вы обучили модель Случайный Лес, в котором 50 деревьев. Рассмотрим 2 случая: 1) Мы убираем первое дерево из модели 2) Мы убираем последнее дерево из модели. Предположите, какая модель будет лучше (или они +- одинаковы) и почему?',
  'Представьте, что вы обучили модель с использованием Градиентного Бустинга, в котором 50 деревьев. Рассмотрим 2 случая: 1) Мы убираем первое дерево из модели 2) Мы убираем последнее дерево из модели. Предположите, какая модель будет лучше (или они +- одинаковы) и почему?',
  'Рассмотрим две ситуации: 1) Вы обучили две модели классификации Случайный Лес, по 25 деревьев в каждой. Ваше итоговое предсказание – усреднение двух моделей 2) Вы обучили одну модель классификации Случайный Лес, в которой 50 деревьев. Остальные гиперпараметры моделей совпадают. Предположите, какая модель будет лучше (или они +- одинаковы) и почему?',
  'Есть градиентный бустинг от яндекса. Он называется "CatBoost". Михаил Сергеевич из Санкт-Петербурга спрашивает: "Ну почему?" (что означает приставка Cat и почему кошки тут не причем {почти})',
  'Сравните хотя бы 2 метода градиентного бустинга (как с т.з. «внутренностей», так и с точки зрения применения на практике)',
  'Предположите, почему ансамблевые модели, основанные на деревьях решений, работают лучше на табличных данных чем Нейронные сети (можно вдохновиться статьёй https://arxiv.org/pdf/2207.08815.pdf )',
  'Как можно отбирать значимые признаки в задачах обработки данных методами машинного обучения? ',
  'Опишите стратегии подбора оптимальных гиперпараметров моделей машинного обучения',
  'Если вы собрались заниматься stacking / blending, то какие модели лучше в этом всём использовать?',
  'Чем подход Бэггинг отличается от метода Головования?',
  'В чем отличие задачи обнаружения выбросов (outlier detection) и обнаружение новизны (novelty detection) в контексте задачи поиска аномалий?',
  'Почему самый базовый метод поиска аномалий в scikit-learn носит название EllepticEnvelope?',
  'LocalOutlierFactor: почему при вычислении Reachability distance получается не симметричная матрица? ',
  'LocalOutlierFactor: на что влияет показатель к-соседей?',
  'Одноклассовый метод опорных векторов: почему отделять выборку от нуля это не бессмысленно?',
  'IsolationForest: как строятся деревья для поиска аномалий?',
  'Почему IsolationForest такой быстрый (https://www.lamda.nju.edu.cn/publication/icdm08b.pdf)?',
]
</script>
